Revit 2024 API
IPrintSetting Interface
An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public interface IPrintSetting
Visual Basic
Public Interface IPrintSetting
Visual C++
public interface class IPrintSetting
See Also
IPrintSetting Members
Autodesk.Revit.DB Namespace